Тренировки/src/Documents/Тренировка/Тренировка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Тренировка</name>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаТренировки</name>
    <type>
      <types>CatalogRef.ПрограммыТренировок</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Упражнения</name>
    <attributes>
      <name>Упражнение</name>
      <type>
        <types>CatalogRef.Упражнения</types>
      </type>
    </attributes>
    <attributes>
      <name>ИДСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Подходы</name>
    <attributes>
      <name>Упражнения_ИДСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Повторений</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тренировки/src/Catalogs/ПрограммыТренировок/ПрограммыТренировок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПрограммыТренировок</name>
  <tabularSections>
    <name>Упражения</name>
    <attributes>
      <name>НомерДня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упражнение</name>
      <type>
        <types>CatalogRef.Упражнения</types>
      </type>
    </attributes>
    <attributes>
      <name>Подходов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тренировки/src/CommonModules/ПрограммыТренировокСервер/Module.bsl
// @strict-types


#Область ПрограммныйИнтерфейс

//Описание:
// возвращает номер следующего дня тренировки после последней проведенной пользователем по программе
//Возвращаемое значение: 
// Число - СледующийНомерДняТренировки
//Параметры: 
// Пользователь - СправочникСсылка.Пользователи
// ПрограммаТренировки - СправочникСсылка.ПрограммыТренировок
Функция ПолучитьСледующийНомерДняТренировки(Пользователь, ПрограммаТренировки) Экспорт
	
	ТекВозврат = 1;
	
	Выборка = ПолучитьСледующийНомерДняТренировки_ПолучитьВыборку(Пользователь, ПрограммаТренировки);
	Пока Выборка.Следующий() Цикл
		ТекВозврат = Выборка.НомерДня;
	КонецЦикла;
	
	Возврат ТекВозврат;
	
КонецФункции

//Описание:
// возвращает таблицу с историей выполнения упражнений 
//Возвращаемое значение: 
// Структура: 
//  * Значения - ТаблицаЗначений
//  * ОписаниеКолонок - Соответствие
//Параметры: 
// Упражнения - Массив из СправочникСсылка.Упражнения
// КоличествоДнейИстории - Число
// ИсключаемыйДокумент - ДокументСсылка.Тренировка 
Функция ПолучитьИсториюВыполненияУпражнений(Упражнения, Знач КоличествоДнейИстории = Неопределено, Знач ИсключаемыйДокумент = Неопределено) Экспорт
	
	ТекВозврат = Новый Структура(); 
	
	тзЗначения = Новый ТаблицаЗначений;
	тзЗначения.Колонки.Добавить("Упражнение");
	
	СоотвОписаниеКолонок = Новый Соответствие();
		
	Если КоличествоДнейИстории = Неопределено Тогда
		КоличествоДнейИстории = Константы.Тренировка_КоличествоКолонокВИстории.Получить();
	КонецЕсли;
	
	тзУпражнения = ТЗУпражнения_Создать(Упражнения);
	
	мДокументыИсключения = Новый Массив; // Массив из ДокументСсылка.Тренировка
	Если ТипЗнч(ИсключаемыйДокумент) = Тип("ДокументСсылка.Тренировка") Тогда
		мДокументыИсключения.Добавить(ИсключаемыйДокумент);
	ИначеЕсли ТипЗнч(ИсключаемыйДокумент) = Тип("Массив") Тогда
		мДокументыИсключения = ИсключаемыйДокумент;
	КонецЕсли;
	
	ВыборкаДата = ПолучитьВыборкуИсторииВыполненияУпражнений(мДокументыИсключения, тзУпражнения);
	Пока ВыборкаДата.Следующий() Цикл
		ВыборкаУпражнение = ВыборкаДата.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаУпражнение.Следующий() Цикл
			ИсторияВыполненияУпражнений_ДобавитьОписание(тзЗначения, соотвОписаниеКолонок, ВыборкаУпражнение);			
		КонецЦикла;
	КонецЦикла;
	
	
	текВозврат.Вставить("Значения", тзЗначения);
	текВозврат.Вставить("ОписаниеКолонок", соотвОписаниеКолонок);
	
	Возврат текВозврат;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ТЗУпражнения создать.
// 
// Параметры:
//  Упражнения - Массив из СправочникСсылка.Упражнения - Упражнения
// 
// Возвращаемое значение:
//  ТаблицаЗначений - ТЗУпражнения создать:
// * Упражнение - СправочникСсылка.Упражнения - 
Функция ТЗУпражнения_Создать(Знач Упражнения)
	
	тзУпражнения = Новый ТаблицаЗначений();
	тзУпражнения.Колонки.Добавить("Упражнение", Новый ОписаниеТипов("СправочникСсылка.Упражнения"));
	Для каждого Упражнение Из Упражнения Цикл
		новСтр = тзУпражнения.Добавить();
		новСтр.Упражнение = Упражнение; 
	КонецЦикла;
	Возврат тзУпражнения
	
КонецФункции

Функция ПолучитьОписаниеУпражненияПоДаннымПодходов(ВыборкаУпражнение)
	
	текВозврат = "";
	
	мПодходы = Новый Массив;//массив из строка
	ВыборкаДетальныеЗаписи = ВыборкаУпражнение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		мПодходы.Добавить(СтрШаблон("%1-%2", ВыборкаДетальныеЗаписи.Повторений, ВыборкаДетальныеЗаписи.Вес));
	КонецЦикла;
	
	текВозврат = СтрСоединить(мПодходы, ";");
	
	Возврат текВозврат;
	
КонецФункции

//Описание:
// добавляет в таблицу данные о выполненном упражнении  
// Параметры:
//  тзЗначения - ТаблицаЗначений - Тз значения:
// * Упражнение - СправочникСсылка.Упражнения 
//  соотвОписаниеКолонок - Соответствие - Дата - Имя колонки
//  ВыборкаУпражнение - ВыборкаИзРезультатаЗапроса - Выборка из запроса
Процедура ИсторияВыполненияУпражнений_ДобавитьОписание(ТЗЗначения, СоотвОписаниеКолонок, ВыборкаУпражнение)
	
	текДата = НачалоДня(ВыборкаУпражнение.Дата);
	текУпражнение = ВыборкаУпражнение.Упражнение;
	ОписаниеУпражнения = ПолучитьОписаниеУпражненияПоДаннымПодходов(ВыборкаУпражнение);
	
	сИмяКолонки = ИсторияВыполненияУпражнений_ПолучитьИмяКолонкиЗначенийПоДате(тзЗначения, соотвОписаниеКолонок, текДата);
	струкПоиск = Новый Структура("Упражнение", текУпражнение);
	мНайденныеСтроки = тзЗначения.НайтиСтроки(струкПоиск);
	Если мНайденныеСтроки.Количество() = 0 Тогда
		текСтр = тзЗначения.Добавить();
		текСтр.Упражнение = текУпражнение;  			
	Иначе
		текСтр = мНайденныеСтроки[0];
	КонецЕсли;
	
	текСтр[сИмяКолонки] = ОписаниеУпражнения;

КонецПроцедуры

// Находит или создает имя колонки значений по дате.
// 
// Параметры:
//  тзЗначения - ТаблицаЗначений - Тз значения:
// * Упражнение - СправочникСсылка.Упражнения - 
//  соотвОписаниеКолонок - Соответствие - Дата - Имя колонки
//  текДата - Дата
// 
// Возвращаемое значение:
//  Строка - Имя колонки
Функция ИсторияВыполненияУпражнений_ПолучитьИмяКолонкиЗначенийПоДате(тзЗначения, Знач соотвОписаниеКолонок, текДата)

	сИмяКолонки = соотвОписаниеКолонок[текДата];
	Если сИмяКолонки = Неопределено Тогда
		сИмяКолонки = "_"+Формат(текДата,"ДФ=yyyyMMdd;");
		тзЗначения.Колонки.Добавить(сИмяКолонки, ОбщегоНазначенияКлиентСервер.ОписаниеТипаСтрока());
		соотвОписаниеКолонок.Вставить(текДата, сИмяКолонки);
	КонецЕсли;
	
	Возврат сИмяКолонки;
	
КонецФункции

// Получить выборку истории выполнения упражнений.
// 
// Параметры:
//  мДокументыИсключения - Массив из ДокументСсылка.Тренировка
//  тзУпражнения - ТаблицаЗначений
// * Упражнение - СправочникСсылка.Упражнения 
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса:
//  	* Ссылка - ДокументСсылка.Тренировка
//  	* Дата - Дата
//  	* Упражнение - СправочникСсылка.Упражнения
//  	* Повторений - Число
//  	* Вес - Число
//  	* НомерСтроки - Число
Функция ПолучитьВыборкуИсторииВыполненияУпражнений(МДокументыИсключения, ТЗУпражнения)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Упражнения.Упражнение КАК Упражнение
	|ПОМЕСТИТЬ ВТ_Упражнения
	|ИЗ
	|	&Упражнения КАК Упражнения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТренировкаУпражнения.Ссылка КАК Ссылка,
	|	ТренировкаУпражнения.Ссылка.Дата КАК Дата,
	|	ТренировкаУпражнения.Упражнение КАК Упражнение,
	|	ТренировкаПодходы.Повторений КАК Повторений,
	|	ТренировкаПодходы.Вес КАК Вес,
	|	ТренировкаПодходы.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ВТ_Упражнения КАК ВТ_Упражнения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Тренировка.Упражнения КАК ТренировкаУпражнения
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Тренировка.Подходы КАК ТренировкаПодходы
	|			ПО (ТренировкаУпражнения.Ссылка = ТренировкаПодходы.Ссылка)
	|				И (ТренировкаПодходы.Упражнения_ИДСтроки = ТренировкаУпражнения.ИДСтроки)
	|		ПО (ВТ_Упражнения.Упражнение = ТренировкаУпражнения.Упражнение)
	|ГДЕ
	|	ТренировкаУпражнения.Ссылка.Пользователь = &Пользователь
	|	И ТренировкаУпражнения.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И Не ТренировкаУпражнения.Ссылка В (&ДокументыИсключения)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ,
	|	Упражнение,
	|	НомерСтроки
	|ИТОГИ ПО
	|	Дата,
	|	Упражнение";
	
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("Упражнения", тзУпражнения);
	Запрос.УстановитьПараметр("ДокументыИсключения", мДокументыИсключения);
	
	ВыборкаДата = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Возврат ВыборкаДата
КонецФункции


// Получить следующий номер дня тренировки получить выборку.
// 
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - Пользователь
//  ПрограммаТренировки - СправочникСсылка.ПрограммыТренировок - Программа тренировки
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса:
//  	* НомерДня - Число
Функция ПолучитьСледующийНомерДняТренировки_ПолучитьВыборку(Пользователь, ПрограммаТренировки)

	Запрос = Новый Запрос;
	Запрос.Текст = "
				   |ВЫБРАТЬ
				   |	МАКСИМУМ(Тренировка.Дата) КАК Дата,
				   |	&Пользователь КАК Пользователь,
				   |	&ПрограммаТренировки КАК ПрограммаТренировки
				   |ПОМЕСТИТЬ ВТ_ДатаПоследнейТренировки
				   |ИЗ
				   |	Документ.Тренировка КАК Тренировка
				   |ГДЕ
				   |	Тренировка.Пользователь = &Пользователь
				   |	И Тренировка.ПрограммаТренировки = &ПрограммаТренировки
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	Тренировка.НомерДня КАК НомерДня
				   |ПОМЕСТИТЬ ВТ_НомерПоследнегоДняТренировки
				   |ИЗ
				   |	ВТ_ДатаПоследнейТренировки КАК ВТ_ДатаПоследнейТренировки
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Тренировка КАК Тренировка
				   |		ПО ВТ_ДатаПоследнейТренировки.Пользователь = Тренировка.Пользователь
				   |			И ВТ_ДатаПоследнейТренировки.Дата = Тренировка.Дата
				   |			И ВТ_ДатаПоследнейТренировки.ПрограммаТренировки = Тренировка.ПрограммаТренировки
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	МАКСИМУМ(ВложенныйЗапрос.НомерДня) КАК НомерДня
				   |ИЗ
				   |	(ВЫБРАТЬ
				   |		МИНИМУМ(ПрограммыТренировокУпражения.НомерДня) КАК НомерДня
				   |	ИЗ
				   |		Справочник.ПрограммыТренировок.Упражения КАК ПрограммыТренировокУпражения
				   |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НомерПоследнегоДняТренировки КАК ВТ_НомерПоследнегоДняТренировки
				   |			ПО ПрограммыТренировокУпражения.НомерДня > ВТ_НомерПоследнегоДняТренировки.НомерДня
				   |				И (ПрограммыТренировокУпражения.Ссылка = &ПрограммаТренировки)
				   |	
				   |	ОБЪЕДИНИТЬ ВСЕ
				   |	
				   |	ВЫБРАТЬ
				   |		1) КАК ВложенныйЗапрос";

	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ПрограммаТренировки", ПрограммаТренировки);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Возврат Выборка;
	
КонецФункции


#КонецОбласти
